loadtest_orders.yml
config:
  target: 'https://sean.codedcommerce.com'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
  payload:
    path: "loadtest_payload.csv"
    fields:
      - "userID"
      - "email"
      - "productID"
      - "quantity"
      - "authHash"
  processor: "./loadtest_monitor.js"

scenarios:
  - flow:
    - log: "Virtual user session for {{ email }}"
    - get:
        url: "/"
    - log: "Starting a New order for {{ email }}"
    - post:
        url: "/wp-json/wc/v2/orders" #?_jsonp=callback
        beforeRequest: "setJSONBody"
        afterResponse: "logHeaders"
        headers:
          Content-Type: "application/json"
          Authorization: "Basic {{ authHash }}"
        json:
            "payment_method": "cheque"
            "payment_method_title": "Check payments"
            "set_paid": false
            "billing":
                "first_name": "Bill First Name"
                "last_name": "Bill Last Name"
                "address_1": "1234 Test St"
                "address_2": "Apt 1234"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
                "email": "{{ email }}"
                "phone": "(111) 222-3333"
            "shipping":
                "first_name": "Ship First Name"
                "last_name": "Ship Last Name"
                "address_1": "1234 Test St"
                "address_2": "Apt 1234"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
            "customer_id": "{{ userID }}"
            "line_items":
              - "product_id": "{{ productID }}"
                "quantity": "{{ quantity }}"