loadtest_orders.yml
config:
  target: 'https://sean.codedcommerce.com'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
  payload:
    path: "loadtest_payload.csv"
    fields:
      - "name"
      - "product_id"
      - "quantity"
      - "authHash"
  processor: "./loadtest_monitor.js"

scenarios:
  - flow:
    - function: "generateUsername"
    - log: "Virtual user session for sequence {{ name }}"
    - get:
        url: "/"
    - log: "Starting a new order for sequence {{ name }}"
    - post:
        url: "/wp-json/wc/v2/customers"
        beforeRequest: "setJSONBody"
        afterResponse: "logHeaders"
        headers:
          Content-Type: "application/json"
          Authorization: "Basic {{ authHash }}"
        json:
            "email": "{{ username }}@codedcommerce.com"
            "first_name": "Bill First Name {{ name }}"
            "last_name": "Bill Last Name {{ name }}"
            "username": "{{ username }}"
            "billing":
                "first_name": "Bill First Name {{ name }}"
                "last_name": "Bill Last Name {{ name }}"
                "address_1": "{{ name }} Test St"
                "address_2": "Apt {{ name }}"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
                "email": "{{ username }}@codedcommerce.com"
                "phone": "(111) 222-3333"
            "shipping":
                "first_name": "Bill First Name {{ name }}"
                "last_name": "Bill Last Name {{ name }}"
                "address_1": "{{ name }} Test St"
                "address_2": "Apt {{ name }}"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
        capture:
          json: "$.id"
          as: "customer_id"
    - post:
        url: "/wp-json/wc/v2/orders"
        beforeRequest: "setJSONBody"
        afterResponse: "logHeaders"
        headers:
          Content-Type: "application/json"
          Authorization: "Basic {{ authHash }}"
        json:
            "payment_method": "cheque"
            "payment_method_title": "Check payments"
            "set_paid": false
            "billing":
                "first_name": "Bill First Name {{ name }}"
                "last_name": "Bill Last Name {{ name }}"
                "address_1": "{{ name }} Test St"
                "address_2": "Apt {{ name }}"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
                "email": "{{ username }}@codedcommerce.com"
                "phone": "(111) 222-3333"
            "shipping":
                "first_name": "Ship First Name {{ name }}"
                "last_name": "Ship Last Name {{ name }}"
                "address_1": "{{ name }} Test St"
                "address_2": "Apt {{ name }}"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
            "customer_id": "{{ customer_id }}"
            "line_items":
              - "product_id": "{{ product_id }}"
                "quantity": "{{ quantity }}"