loadtest_orders.yml
config:
  target: 'https://sean.codedcommerce.com'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
  payload:
    path: "loadtest_payload.csv"
    fields:
      - "sequenceNum"
      - "customer_id"
      - "email"
      - "product_id"
      - "quantity"
      - "authHash"
  processor: "./loadtest_monitor.js"

scenarios:
  - flow:
    - log: "Virtual user session for sequence number {{ sequenceNum }}"
    - get:
        url: "/"
    - log: "Starting a new order for sequence number {{ sequenceNum }}"
    - post:
        url: "/wp-json/wc/v2/orders"
        beforeRequest: "setJSONBody"
        afterResponse: "logHeaders"
        headers:
          Content-Type: "application/json"
          Authorization: "Basic {{ authHash }}"
        json:
            "payment_method": "cheque"
            "payment_method_title": "Check payments"
            "set_paid": false
            "billing":
                "first_name": "Bill First Name {{ sequenceNum }}"
                "last_name": "Bill Last Name {{ sequenceNum }}"
                "address_1": "{{ sequenceNum }} Test St"
                "address_2": "Apt {{ sequenceNum }}"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
                "email": "{{ email }}"
                "phone": "(111) 222-3333"
            "shipping":
                "first_name": "Ship First Name {{ sequenceNum }}"
                "last_name": "Ship Last Name {{ sequenceNum }}"
                "address_1": "{{ sequenceNum }} Test St"
                "address_2": "Apt {{ sequenceNum }}"
                "city": "Los Angeles"
                "state": "CA"
                "postcode": "91307"
                "country": "US"
            "customer_id": "{{ customer_id }}"
            "line_items":
              - "product_id": "{{ product_id }}"
                "quantity": "{{ quantity }}"