loadtest_synthetic.yml
config:
  target: 'https://dev-sean-sandbox.pantheonsite.io'
  tls: {
    "rejectUnauthorized": false
  }
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 3
  payload:
    path: "loadtest_payload.csv"
    fields:
      - "name"
      - "product_id"
      - "quantity"
      - "authHash"
  processor: "./loadtest_synthetic.js"

scenarios:
  - flow:
    - log: "Start virtual user {{ name }}, quantity {{ quantity }}"
    - function: "runTest"
    - log: "End virtual user {{ name }}, quantity {{ quantity }}, order number {{ order_number }}, lapsed {{ lapsed }}"