loadtest_synthetic.yml
config:
  target: 'https://demo.acceleratedstore.com/shop/'
  #tls: {
  #  "rejectUnauthorized": false
  #}
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 2
  payload:
    path: "loadtest_payload.csv"
    fields:
      - "name"
      - "product_id"
      - "quantity"
      - "authHash"
  processor: "./loadtest_synthetic.js"

scenarios:
  - flow:
    - log: "Start virtual user {{ name }}, product_id {{ product_id }}, quantity {{ quantity }}"
    - function: "runTest"
    - log: "Stop virtual user {{ counter_start_ms }}, order number {{ order_number }}, lapsed {{ lapsed }} ms"